case/validation/validationFront1D/0/C.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 16;

boundaryField
{
    outlet
    {
        type           zeroGradient;
    }
    inlet
    {
        type           fixedValue;
        value          uniform 16;

    }
    top
    {
        type           empty;
    }
    bottom
    {
        type           empty;
    }
    frontAndBack
    {
        type           empty;
    }
//    back
//    {
//        type           zeroGradient;
//    }
}

// ************************************************************************* //
